for <a href="https://github.com/MuratCelik3506/Data_Science_WorkSpace/blob/main/NoteBook/Python/Pandas/Pandas_1.1_.ipynb">  "Pandas_1.1_.ipynb" </a>
## My name is Murat Ã‡elik
    I am interested in Data Science<br>
    I am a student of Computer Science in Hacettepe University
 <a href="https://www.linkedin.com/in/muratcelik35/">
     Contact:

</a> 
<br><br>
<h4><b>Date</b><br></h4>
&nbsp;&nbsp;&nbsp;&nbsp;26/02/2021 : Created Numpy notebook

<img src="../pandas/pandas.png" alt="Numpy" width="500" height="600">

# Operating on Data in Pandas
### Ufuncs: Index Presevation
Because Pandas is designed to work with NumPy, any NumPy ufunc will work on
Pandas Series and DataFrame objects.

In [2]:
# import library
import pandas as pd
import numpy as np

In [7]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [8]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [9]:
# If we apply a NumPy ufunc on either of these objects, the result will be 
#                                                         another Pandasobject with the indices preserved:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [10]:
np.sin(df*np.pi/4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

### UFuncs: Index Alignment

In [11]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
'New York': 19651127}, name='population')

In [12]:
# The resulting array contains the union of indices of the two input arrays
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [13]:
# For solve Nan Problem
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [14]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [16]:
# Another solve for Nan Problem
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
columns=list('AB'))
print(A)
print()
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
columns=list('BAC'))
print(B)

    A   B
0  19   2
1   4  18

   B  A  C
0  6  4  8
1  6  1  3
2  8  1  9

In [17]:
A+B

      A     B   C
0  23.0   8.0 NaN
1   5.0  24.0 NaN
2   NaN   NaN NaN

In [19]:
fill = A.stack().mean() # 10.75
A.add(B,fill_value=fill)

       A      B      C
0  23.00   8.00  18.75
1   5.00  24.00  13.75
2  11.75  18.75  19.75

## Handling Missing Data
The difference between data found in many tutorials and data in the real world is that
real-world data is rarely clean and homogeneous. In particular, many interesting
datasets will have some amount of data missing. To make matters even more complicated,
different data sources may indicate missing data in different ways.

refer to missing data in general as null, NaN, or NA values.

In [28]:
x = np.array([1,3,np.nan,4])
x

array([ 1.,  3., nan,  4.])

In [29]:
x.sum()

nan

In [31]:
np.nansum(x)

8.0

In [32]:
x = pd.Series([1,np.nan,2,None])
x

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [34]:
x.sum() # difference numpy

3.0

In [35]:
x = pd.Series(range(2),dtype=int)
x

0    0
1    1
dtype: int32

In [36]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [37]:
x.sum()

1.0

### Operating on Null Values
There are several useful mthods for detecting, removing and replacing null values in Pandas data structures

They are:

isnull()<br>
Generate a Boolean mask indicating missing values

notnull()<br>
Opposite of isnull()

dropna()<br>
Return a filtered version of the data

fillna()<br>
Return a copy of the data with missing values filled or imputed

#### Detecting null values

In [39]:
data = pd.Series([1,np.nan,'hello',None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [40]:
data.isnull() # if value is nan, return True

0    False
1     True
2    False
3     True
dtype: bool

In [41]:
data.notnull() # if value is nan, return False

0     True
1    False
2     True
3    False
dtype: bool

In [43]:
data[data.notnull()] # print nonnull value in data

0        1
2    hello
dtype: object

#### Dropping null values

In [44]:
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [45]:
data.dropna() # if nan in data,ignore it and print nonnull value

0        1
2    hello
dtype: object

In [46]:
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [48]:
df = pd.DataFrame([[1, np.nan, 2],
[2, 3, 5],
[np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [49]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [50]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [51]:
df = df.dropna()
df

     0    1  2
1  2.0  3.0  5

In [52]:
df = pd.DataFrame([[1, np.nan, 2],
[2, 3, 5],
[np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [53]:
df.dropna(axis="columns") # if columns have not nan value, print it

   2
0  2
1  5
2  6

In [56]:
df = pd.DataFrame([[1, np.nan, 2,np.nan],
[2, 3, 5,np.nan],
[np.nan, 4, 6,np.nan]])
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [57]:
df.dropna(axis="columns",how ="any") # if columns have not nan value, print it => default value is any

   2
0  2
1  5
2  6

In [58]:
df.dropna(axis="columns",how ="all") # if columns have not value, ignore it and print others

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [59]:
df = pd.DataFrame([[1, np.nan, 2,np.nan],
[2, 3, 5,np.nan],
[4, 5, 8,np.nan],
[np.nan, np.nan, 6,np.nan]])
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  4.0  5.0  8 NaN
3  NaN  NaN  6 NaN

In [60]:
df.dropna(axis="rows",how ="all") # if rows have not value, ignore it and print others

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  4.0  5.0  8 NaN
3  NaN  NaN  6 NaN

In [62]:
df.dropna(axis="rows",how ="any") # if rows have not value, ignore it and print others

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [67]:
df.dropna(axis="rows",thresh =3) # if rows have at least 3 value, print it; else ignore it

     0    1  2   3
1  2.0  3.0  5 NaN
2  4.0  5.0  8 NaN

### Filling null values

In [68]:
df.fillna(999)

       0      1  2      3
0    1.0  999.0  2  999.0
1    2.0    3.0  5  999.0
2    4.0    5.0  8  999.0
3  999.0  999.0  6  999.0

In [69]:
df.fillna(method="ffill") # We can specify a forward-fill to propagate the previous value forward

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  4.0  5.0  8 NaN
3  4.0  5.0  6 NaN

In [70]:
df.fillna(method="bfill") # We can specify a back-fill to propagate the next value forward

     0    1  2   3
0  1.0  3.0  2 NaN
1  2.0  3.0  5 NaN
2  4.0  5.0  8 NaN
3  NaN  NaN  6 NaN

In [71]:
df.fillna(method="ffill", axis=1) # We can change axis

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  4.0  5.0  8.0  8.0
3  NaN  NaN  6.0  6.0